Project/Toir/src/Documents/торо_ВнешнееОснованиеДляРабот/торо_ВнешнееОснованиеДляРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>торо_ВнешнееОснованиеДляРабот</name>
  <basedOn>Document.торо_АктОВыполненииРегламентногоМероприятия</basedOn>
  <registerRecords>InformationRegister.торо_СтатусыДокументовВнешнихОснованийУстановленные</registerRecords>
  <registerRecords>InformationRegister.торо_Ремонты</registerRecords>
  <registerRecords>InformationRegister.торо_ВнешниеОснованияДляРабот</registerRecords>
  <registerRecords>InformationRegister.торо_СтатусыДокументовВнешнихОснований</registerRecords>
  <registerRecords>InformationRegister.торо_ОперацииВнешнихОснованийДляРабот</registerRecords>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусДокумента</name>
    <type>
      <types>CatalogRef.торо_СтатусыСогласованияДокументовРемонтныхРабот</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособСогласования</name>
    <type>
      <types>CatalogRef.торо_СпособыСогласованияДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.торо_АктОВыполненииРегламентногоМероприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Комиссия</name>
    <type>
      <types>CatalogRef.торо_Комиссии</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОбследованноеОборудование</name>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектРемонта</name>
      <type>
        <types>CatalogRef.торо_ОбъектыРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>ТиповойДефект</name>
      <type>
        <types>CatalogRef.торо_ТиповыеДефектыОборудования</types>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ПлановаяДатаРемонта</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
      </type>
    </attributes>
    <attributes>
      <name>ГарантийныйРемонт</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>гкс_ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РемонтныеРаботы</name>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РемонтнаяРабота</name>
      <type>
        <types>CatalogRef.торо_ТехнологическиеОперации</types>
        <types>CatalogRef.торо_ИдентификаторыТехКарт</types>
      </type>
    </attributes>
    <attributes>
      <name>Родитель_ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Предписание_ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Картинка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИсторияСтатусов</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаКого</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусДокумента</name>
      <type>
        <types>CatalogRef.торо_СтатусыСогласованияДокументовРемонтныхРабот</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Согласующие</name>
    <attributes>
      <name>Согласующий</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Согласовано</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроведениеДокумента</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Порядок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусДокумента</name>
      <type>
        <types>CatalogRef.торо_СтатусыСогласованияДокументовРемонтныхРабот</types>
      </type>
    </attributes>
    <attributes>
      <name>Замещающий</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Project/Toir/src/InformationRegisters/торо_ОстановочныеРемонты/торо_ОстановочныеРемонты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ОстановочныеРемонты</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Отвязан</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДатаНачалаРемонта</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончанияРемонта</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>IDОсновного</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>IDЗависимого</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Удалить_ID_Корректировок</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/Enums/торо_ВидыДокументовСогласованияРемонтов/торо_ВидыДокументовСогласованияРемонтов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>торо_ВидыДокументовСогласованияРемонтов</name>
  <enumValues>
    <name>торо_ВыявленныеДефекты</name>
  </enumValues>
  <enumValues>
    <name>торо_АктОВыполненииЭтапаРабот</name>
  </enumValues>
  <enumValues>
    <name>торо_ПланГрафикРемонта</name>
  </enumValues>
  <enumValues>
    <name>торо_ЗаявкаНаРемонт</name>
  </enumValues>
  <enumValues>
    <name>торо_НарядНаВыполнениеРемонтныхРабот</name>
  </enumValues>
  <enumValues>
    <name>торо_ВнешнееОснованиеДляРабот</name>
  </enumValues>
  <enumValues>
    <name>торо_АктПриемкиОборудования</name>
  </enumValues>
  <enumValues>
    <name>торо_ОстановочныеРемонты</name>
  </enumValues>
  <enumValues>
    <name>торо_ПланРаботПодразделения</name>
  </enumValues>
  <enumValues>
    <name>гкс_ЕВОБланк</name>
  </enumValues>
</mdclass:Enum>

Project/Toir/src/Enums/торо_ВидыВыходныхДокументов/торо_ВидыВыходныхДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>торо_ВидыВыходныхДокументов</name>
  <enumValues>
    <name>УчетКонтролируемыхПоказателей</name>
  </enumValues>
  <enumValues>
    <name>УчетНаработкиОборудования</name>
  </enumValues>
  <enumValues>
    <name>СостояниеОР</name>
  </enumValues>
  <enumValues>
    <name>Предписание</name>
  </enumValues>
  <enumValues>
    <name>ВыявленныйДефект</name>
  </enumValues>
</mdclass:Enum>

Project/Toir/src/Catalogs/торо_ТехнологическиеОперации/торо_ТехнологическиеОперации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>торо_ТехнологическиеОперации</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НормаВремени</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Расценка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БазоваяЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>СодержаниеРабот</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Опасная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РаботаПовышеннойОпасности</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособРасчетаПродолжительности</name>
    <type>
      <types>EnumRef.торо_СпособыРасчетаПродолжительности</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьКоэффициент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеДляПечати</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>МатериальныеЗатраты</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Качество</name>
      <type>
        <types>EnumRef.ГрадацииКачества</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТрудовыеЗатраты</name>
    <attributes>
      <name>Квалификация</name>
      <type>
        <types>CatalogRef.торо_КвалификацииРемонтногоПерсонала</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяРаботы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>11</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИнструментыИТехника</name>
    <attributes>
      <name>Инструмент</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяРаботы</name>
      <comment>Время работы персонала данной квалификации</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Расценка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Project/Toir/src/Documents/торо_ВнешнееОснованиеДляРабот/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	Если Параметры.Свойство("ID") Тогда
		Строки = Объект.ОбследованноеОборудование.НайтиСтроки(Новый Структура("ID", Параметры.ID));
		Если Строки.Количество() Тогда
			Элементы.ОбследованноеОборудование.ТекущаяСтрока = Строки[0].ПолучитьИдентификатор();
		КонецЕсли;
	КонецЕсли;
	
	// Заголовок формы++
	торо_РаботаСДиалогами.УстановитьЗаголовокФормыДокумента(Объект, ЭтаФорма, "");
	// Заголовок формы--
	
	// Согласование++
	ВидДокумента = Перечисления.торо_ВидыДокументовСогласованияРемонтов.торо_ВнешнееОснованиеДляРабот;
	торо_РаботаССогласованиями.ПриСозданииНаСервере(ЭтаФорма, ВидДокумента);
	// Согласование--

	ФОИспользоватьГарантии      = ПолучитьФункциональнуюОпцию("торо_ИспользоватьГарантии");
	ФОИспользоватьОстановочные	= ПолучитьФункциональнуюОпцию("торо_ИспользоватьОстановочныеРемонты");
	
	ОбновитьОстановочные();
	ОбновитьДоступностьДляРедактирования();
	
	// Ограничение ввода на основании
	торо_СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка, Новый Структура("ОграничитьВводНаОсновании, ДокументыОснования, УстановитьСвойствоЭлементовФормыОтПрав",Истина,Истина, Истина));	
	// Конец ограничение ввода на основании
	
	// >> [Деснол] [Ушаков А.Д.] [03.10.2019]
	дс_ЛокализоватьУсловноеОформление();
	// << [Деснол] [Ушаков А.Д.] [03.10.2019] 
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.Свойства
    УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) 
		И ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		ПодключитьОбработчикОжидания("ПодборОРОбработчикОжидания",0.5,Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение
		И ФОИспользоватьГарантии Тогда
		
		торо_ГарантийноеОбслуживание.СформироватьПредупрежденияОРекламационныхАктах(Объект, "ОбследованноеОборудование");
	КонецЕсли;
	
	// Согласование++
	торо_РаботаССогласованиями.ПередЗаписьюНаСервере(ЭтаФорма, ТекущийОбъект);
	// Согласование--

КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// Согласование++
	торо_РаботаССогласованиями.ПриЗаписиНаСервере(ЭтаФорма, ТекущийОбъект);
	// Согласование--
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// Заголовок формы++
	торо_РаботаСДиалогами.УстановитьЗаголовокФормыДокумента(Объект, ЭтаФорма, "");
	// Заголовок формы--

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	ДеревоРемонтныхРаботОбработкаВыбора(, ВыбранноеЗначение, );	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// СтандартныеПодсистемы.Свойства 
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
	// Согласование++
	Если ИмяСобытия = "УтверждениеСтатусаСогласования" Тогда
		Если Параметр.Документ = Объект.Ссылка Тогда
			ЗавершитьУтверждениеСтатусаДокумента(Параметр);
		КонецЕсли;
	КонецЕсли;
	// Согласование--

КонецПроцедуры

// гкс+ [Перед записью] Куст 28.10.2020
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
КонецПроцедуры
// гкс- [Перед записью] Куст 28.10.2020

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Согласование++
&НаКлиенте
Процедура СпособСогласованияПриИзменении(Элемент)
	
	Если фПослеОчистки = Ложь Тогда
		ОбновитьДеревоСогласующих(Истина);
		торо_РаботаССогласованиямиКлиентСервер.ДобавитьСтрокуВИсториюСтатусов(ЭтаФорма, СтатусДокументаРегистр,, Истина);
	Иначе
		фПослеОчистки = Ложь;
	КонецЕсли;
	
	УправлениеВидимостью(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура СпособСогласованияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если СогласующиеРегистр.Количество() > 0 Тогда
		
		СтандартнаяОбработка = Ложь;
		ОписаниеОповещения = Новый ОписаниеОповещения("СпособСогласованияНачалоВыбораЗавершение",ЭтотОбъект,Новый Структура("Элемент",Элемент));
		ПоказатьВопрос(ОписаниеОповещения, НСтр("es='¡Los datos de los estatus establecidos del documento serán limpiados! ¿Continuar?';ru='Данные по установленным статусам документа будут очищены! Продолжить?';en='Data on the established statuses of the document will be cleared! Continue?'"), РежимДиалогаВопрос.ДаНет);

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СпособСогласованияОчистка(Элемент, СтандартнаяОбработка)
	Если Элемент.Значение = ПредопределенноеЗначение("Справочник.торо_СпособыСогласованияДокументов.ПустаяСсылка") Тогда
		фПослеОчистки = Истина;
	КонецЕсли;
КонецПроцедуры
// Согласование--

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(
		Элемент.ТекстРедактирования, ЭтотОбъект, "Объект.Комментарий");

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОбследованноеОборудование

&НаКлиенте
Процедура ОбследованноеОборудованиеПриАктивизацииСтроки(Элемент)

	ТекущиеДанные = Элементы.ОбследованноеОборудование.ТекущиеДанные;
	Если Не ТекущиеДанные = Неопределено Тогда
		
		МассивСтрокРемонтныхРабот = Объект.РемонтныеРаботы.НайтиСтроки(Новый Структура("Предписание_ID",ТекущиеДанные.ID));
		
		СоответствиеID = Новый Соответствие;
		
		Для каждого СтрокаМассива Из МассивСтрокРемонтныхРабот Цикл
			
			ID_Родителя = СтрокаМассива.Родитель_ID;
			
			НайдСоответствие = СоответствиеID.Получить(ID_Родителя);
			
			Если НайдСоответствие = Неопределено Тогда
				МассивСтрокСоответствия = Новый Массив;
				МассивСтрокСоответствия.Добавить(СтрокаМассива);
				СоответствиеID.Вставить(ID_Родителя, МассивСтрокСоответствия);
			Иначе
				МассивСтрокСоответствия = НайдСоответствие;
				МассивСтрокСоответствия.Добавить(СтрокаМассива);
			КонецЕсли; 
			
		КонецЦикла; 
		
		ЭлементыДерева = ДеревоРемонтныхРабот.ПолучитьЭлементы();
		ЭлементыДерева.Очистить();

		ЭлементДерева = ЭлементыДерева.Добавить();
		
		// >> [Деснол] [Ушаков А.Д.] [03.10.2019] 
		ЭлементДерева.РемонтнаяРабота = дс_ПолучитьПредставлениеКорневойРемонтнойРаботы();	
		// << [Деснол] [Ушаков А.Д.] [03.10.2019] 
		ЭлементДерева.Картинка        = 4; 
		
		ЗаполнитьДерево(ЭлементДерева,СоответствиеID,"");
		
		ЗаполнитьЕдиницыИзмерения(ДеревоРемонтныхРабот);
		
		УстановитьДоступностьДляРедактированияПоТекРемонту(ТекущиеДанные.БлокироватьДляИзменения);
		
	КонецЕсли;
	
	Если ДеревоРемонтныхРабот.ПолучитьЭлементы().Количество() > 0 Тогда
		
		Элементы.ДеревоРемонтныхРабот.Развернуть(ДеревоРемонтныхРабот.ПолучитьЭлементы()[0].ПолучитьИдентификатор(),Истина);

	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ОбследованноеОборудованиеПередУдалением(Элемент, Отказ)
	ТекДанные = Элемент.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
	
		Возврат;
	
	КонецЕсли;
	
	Если ТекДанные.БлокироватьДляИзменения Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	СтруктураСвязанныхТЧ = Новый Структура("РемонтныеРаботы");
	
	СтруктураПоиска = Новый Структура("Предписание_ID", ТекДанные.ID);
	
	Для Каждого КлючИЗначение Из СтруктураСвязанныхТЧ Цикл
		
		МассивНайденныхСтрок = Объект[КлючИЗначение.Ключ].НайтиСтроки(СтруктураПоиска);
	    Для Каждого ЭлементМассива Из МассивНайденныхСтрок Цикл
		
			Объект[КлючИЗначение.Ключ].Удалить(ЭлементМассива);
		
		КонецЦикла;
		
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОбследованноеОборудованиеПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока И Копирование Тогда
		
		ТекДанные = Элемент.ТекущиеДанные;
		ТекДанные.БлокироватьДляИзменения = Ложь;
		ТекДанные.ID = Новый УникальныйИдентификатор();
		
		ЭлементыДерева = ДеревоРемонтныхРабот.ПолучитьЭлементы();
		ЭлементыДерева.Очистить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбследованноеОборудованиеПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	ТекДанные = Элемент.ТекущиеДанные;
	
	Если Не ТекДанные = Неопределено Тогда
		
		Если НоваяСтрока И Не ОтменаРедактирования Тогда	
			ТекДанные.ID = Новый УникальныйИдентификатор();
		КонецЕсли;
		
		Если ФОИспользоватьГарантии Тогда
			
			ТекДанные.ГарантийныйРемонт = торо_ГарантийноеОбслуживание.ПолучитьЗначениеФлагаГарантийныйРемонтДляОбъектаРемонта(ТекДанные.ОбъектРемонта, НачалоДня(ТекДанные.ПлановаяДатаРемонта), ТекДанные.ПлановаяДатаРемонта);
			
		КонецЕсли; 
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбследованноеОборудованиеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда
		Для каждого Элем Из ВыбранноеЗначение Цикл
			НовСтрокаОРР = Объект.ОбследованноеОборудование.Добавить();
			НовСтрокаОРР.ОбъектРемонта = Элем;
			НовСтрокаОРР.ID = Новый УникальныйИдентификатор();
			НовСтрокаОРР.Исполнитель = торо_ОбщегоНазначенияВызовСервера.ЗначениеРеквизитаОбъекта(Элем, "ПодразделениеИсполнитель");
			Элементы.ОбследованноеОборудование.ТекущаяСтрока = НовСтрокаОРР.ПолучитьИдентификатор();
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("СписокЗначений") Тогда
		Для каждого Элем Из ВыбранноеЗначение Цикл
			НовСтрокаОРР = Объект.ОбследованноеОборудование.Добавить();
			НовСтрокаОРР.ОбъектРемонта = Элем.Значение;
			НовСтрокаОРР.ID = Новый УникальныйИдентификатор();
			НовСтрокаОРР.Исполнитель = торо_ОбщегоНазначенияВызовСервера.ЗначениеРеквизитаОбъекта(Элем, "ПодразделениеИсполнитель");
			Элементы.ОбследованноеОборудование.ТекущаяСтрока = НовСтрокаОРР.ПолучитьИдентификатор();
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		
		Если ВыбранноеЗначение.Свойство("ОбъектРемонта") Тогда
			
			ИсполнительИзСтруктуры = Неопределено;
			ВыбранноеЗначение.Свойство("ПодразделениеИсполнитель", ИсполнительИзСтруктуры);
			
			Если ТипЗнч(ВыбранноеЗначение.ОбъектРемонта) = Тип("Массив") Тогда
				
				МассивОР = ВыбранноеЗначение.ОбъектРемонта;
				Для каждого ОбъектРемонта из МассивОР Цикл
					НовСтрокаОРР = Объект.ОбследованноеОборудование.Добавить();
					НовСтрокаОРР.ОбъектРемонта = ОбъектРемонта;
					НовСтрокаОРР.ID = Новый УникальныйИдентификатор();
					НовСтрокаОРР.Исполнитель = ИсполнительИзСтруктуры;
					Если Не ЗначениеЗаполнено(ИсполнительИзСтруктуры) Тогда
						НовСтрокаОРР.Исполнитель = торо_ОбщегоНазначенияВызовСервера.ЗначениеРеквизитаОбъекта(ОбъектРемонта, "ПодразделениеИсполнитель");
					КонецЕсли;
					Элементы.ОбследованноеОборудование.ТекущаяСтрока = НовСтрокаОРР.ПолучитьИдентификатор();
				КонецЦикла;
				
			Иначе
				
				НовСтрокаОРР = Объект.ОбследованноеОборудование.Добавить();
				НовСтрокаОРР.ОбъектРемонта = ВыбранноеЗначение.ОбъектРемонта;
				НовСтрокаОРР.ID = Новый УникальныйИдентификатор();
				НовСтрокаОРР.Исполнитель = ИсполнительИзСтруктуры;
				Если Не ЗначениеЗаполнено(ИсполнительИзСтруктуры) Тогда
					НовСтрокаОРР.Исполнитель = торо_ОбщегоНазначенияВызовСервера.ЗначениеРеквизитаОбъекта(ОбъектРемонта, "ПодразделениеИсполнитель");
				КонецЕсли;
				Элементы.ОбследованноеОборудование.ТекущаяСтрока = НовСтрокаОРР.ПолучитьИдентификатор();
				
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе              		
		НовСтрокаОРР = Объект.ОбследованноеОборудование.Добавить();
		НовСтрокаОРР.ОбъектРемонта = ВыбранноеЗначение;
		НовСтрокаОРР.Исполнитель = торо_ОбщегоНазначенияВызовСервера.ЗначениеРеквизитаОбъекта(ВыбранноеЗначение, "ПодразделениеИсполнитель");
		НовСтрокаОРР.ID = Новый УникальныйИдентификатор();
		Элементы.ОбследованноеОборудование.ТекущаяСтрока = НовСтрокаОРР.ПолучитьИдентификатор();
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбследованноеОборудованиеОбъектРемонтаАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыВыбора, Ожидание, СтандартнаяОбработка)
	ПараметрыВыбора.Отбор.Вставить("Документ", Строка(ТипЗнч(Объект.Ссылка)));
КонецПроцедуры

&НаКлиенте
Процедура ОбследованноеОборудованиеОбъектРемонтаОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыВыбора, СтандартнаяОбработка)
	ПараметрыВыбора.Отбор.Вставить("Документ", Строка(ТипЗнч(Объект.Ссылка)));
КонецПроцедуры

&НаКлиенте
Процедура ОбследованноеОборудованиеПередНачаломИзменения(Элемент, Отказ)
	
	ТекДанные = Элемент.ТекущиеДанные;
	Если Не ТекДанные = Неопределено И ТекДанные.БлокироватьДляИзменения Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбследованноеОборудованиеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекДанные = Элемент.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		Если Поле.Имя = "ОбследованноеОборудованиеВРамкахОстановочного" И ЗначениеЗаполнено(ТекДанные.ВРамкахОстановочного) Тогда
			ОткрытьФорму("Документ.торо_ОстановочныеРемонты.ФормаОбъекта", Новый Структура("Ключ, ID", ТекДанные.ВРамкахОстановочного, ТекДанные.ID), ЭтаФорма);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбследованноеОборудованиеПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если НЕ Копирование Тогда
		Отказ = Истина;
		ОткрытьФорму("Справочник.торо_ОбъектыРемонта.ФормаВыбора",,Элемент,ЭтаФорма.УникальныйИдентификатор);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбследованноеОборудованиеТиповойДефектНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	текДанные = Элементы.ОбследованноеОборудование.ТекущиеДанные;
	Если текДанные = Неопределено или Не ЗначениеЗаполнено(текДанные.ОбъектРемонта) Тогда
		Возврат;
	КонецЕсли;	
	
	Отборы = Новый Структура("Владелец", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(текДанные.ОбъектРемонта, "Направление"));
	ПараметрыОткрытия = Новый Структура("Отбор", Отборы);
	ОткрытьФорму("Справочник.торо_ТиповыеДефектыОборудования.ФормаВыбора", ПараметрыОткрытия, Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ОбследованноеОборудованиеТиповойДефектОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	текДанные = Элементы.ОбследованноеОборудование.ТекущиеДанные;
	Если текДанные = Неопределено или Не ЗначениеЗаполнено(текДанные.ОбъектРемонта) Тогда
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;
	
	НаправлениеОР = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(текДанные.ОбъектРемонта, "Направление");
	ПараметрыПолученияДанных.Отбор.Вставить("Владелец", НаправлениеОР);
КонецПроцедуры

&НаКлиенте
Процедура ОбследованноеОборудованиеТиповойДефектАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	Если Ожидание > 0 Тогда
		текДанные = Элементы.ОбследованноеОборудование.ТекущиеДанные;
		Если текДанные = Неопределено или Не ЗначениеЗаполнено(текДанные.ОбъектРемонта) Тогда
			СтандартнаяОбработка = Ложь;
			Возврат;
		КонецЕсли;
		
		НаправлениеОР = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(текДанные.ОбъектРемонта, "Направление");
		ПараметрыПолученияДанных.Отбор.Вставить("Владелец", НаправлениеОР);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДеревоРемонтныхРабот
&НаКлиенте
Процедура ДеревоРемонтныхРаботПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ДеревоРемонтныхРабот.ТекущиеДанные;
	Если Не ТекущиеДанные = Неопределено Тогда
		МассивСтрок = Объект.РемонтныеРаботы.НайтиСтроки(Новый Структура("ID",ТекущиеДанные.ID));
		Если МассивСтрок.Количество() > 0 Тогда
			
			МассивСтрок[0].Количество = ТекущиеДанные.Количество;
			
		КонецЕсли; 
		
		Если Объект.РемонтныеРаботы.Количество() > 1 Тогда 
			торо_ДанныеФормыДеревоКлиентСервер.УпорядочитьРемонтныеРаботы(ДеревоРемонтныхРабот, Объект.РемонтныеРаботы);
		КонецЕсли;
		
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ДеревоРемонтныхРаботПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;	
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоРемонтныхРаботПередУдалением(Элемент, Отказ)
	
    ТекСтрокаДРР = Элементы.ДеревоРемонтныхРабот.ТекущиеДанные;
	ТекРемонт = Элементы.ОбследованноеОборудование.ТекущиеДанные;
	
	// >> [Деснол] [Ушаков А.Д.] [03.10.2019] 
	Если НЕ ЗначениеЗаполнено(ТекСтрокаДРР.Родитель_ID) И ТекСтрокаДРР.РемонтнаяРабота = дс_ПолучитьПредставлениеКорневойРемонтнойРаботы() Тогда
	//Если НЕ ЗначениеЗаполнено(ТекСтрокаДРР.Родитель_ID) И ТекСтрокаДРР.РемонтнаяРабота = "Ремонтные работы" Тогда
	// << [Деснол] [Ушаков А.Д.] [03.10.2019] 
		
		ТекСтрокаДРР.ПолучитьЭлементы().Очистить();
		
		Если Не ТекРемонт = Неопределено Тогда 
			МассивСтрокРемонтныхРабот = Объект.РемонтныеРаботы.НайтиСтроки(Новый Структура("Предписание_ID", ТекРемонт.ID));
			Для Каждого Строка Из МассивСтрокРемонтныхРабот Цикл 
				Объект.РемонтныеРаботы.Удалить(Строка);
			КонецЦикла;
		Иначе
			Возврат;
		КонецЕсли;
		
		Модифицированность = Истина;
		Отказ = Истина;
		
	Иначе
		
		ВыделенныеСтроки = Элементы.ДеревоРемонтныхРабот.ВыделенныеСтроки;
		МассивСтрокДляУдаления = Новый Массив;
		
		Для каждого Стр Из ВыделенныеСтроки Цикл 
			Строка = ДеревоРемонтныхРабот.НайтиПоИдентификатору(Стр);
			// >> [Деснол] [Ушаков А.Д.] [03.10.2019] 
			Если Строка <> Неопределено И Строка.РемонтнаяРабота <> дс_ПолучитьПредставлениеКорневойРемонтнойРаботы() Тогда 
			//Если Строка <> Неопределено И Строка.РемонтнаяРабота <> "Ремонтные работы" Тогда 
			// << [Деснол] [Ушаков А.Д.] [03.10.2019] 
				МассивСтрокДляУдаления.Добавить(Строка);
			КонецЕсли;
		КонецЦикла;		
		
		Для каждого Элемент Из МассивСтрокДляУдаления Цикл
			СтруктурыДляПередачи = Новый Структура("ID, Предписание_ID, Родитель_ID, РемонтнаяРабота",
			Элемент.ID, Элемент.Предписание_ID, Элемент.Родитель_ID, Элемент.РемонтнаяРабота);
			УдалитьДанныеТабличныхЧастейПоIDСтрокиДерева(СтруктурыДляПередачи, ЭтотОбъект, Новый Структура("РемонтныеРаботы"));
			
			СтрокаРодителя = Элемент.ПолучитьРодителя();
			СтрокаРодителя.ПолучитьЭлементы().Удалить(Элемент); 
		КонецЦикла;
		
		
		Модифицированность = Истина;
		Отказ = Истина;
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоРемонтныхРаботОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ТекРемонт = Элементы.ОбследованноеОборудование.ТекущиеДанные;
	
	Если ТекРемонт <> Неопределено Тогда
		РемонтыОборудования_ID = ТекРемонт.ID;
	Иначе
		РемонтыОборудования_ID = "";
	КонецЕсли;
	
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда 
		Для каждого ТОперация ИЗ ВыбранноеЗначение Цикл 
			НС = Объект.РемонтныеРаботы.Добавить();
			НС.Предписание_ID  = РемонтыОборудования_ID;
			НС.РемонтнаяРабота = ТОперация;
			НС.ID              = Новый УникальныйИдентификатор;
			НС.Количество      = 1;
			НС.Картинка        = 0;  
		КонецЦикла;
	КонецЕсли;

	Модифицированность = Истина;

	ОбследованноеОборудованиеПриАктивизацииСтроки(ТекРемонт); 	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

&НаКлиенте
Процедура ДобавитьТехОперацию(Команда)
	
	ТекущиеДанные = Элементы.ДеревоРемонтныхРабот.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		ПоказатьПредупреждение(Неопределено, НСтр("es='¡Indiquen la disposición de la reparación!';ru='Укажите расположение ремонта!';en='Specify  the location of the repair!'"), 10); 
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ТекущиеДанные.РемонтнаяРабота) = Тип("СправочникСсылка.торо_ТехнологическиеОперации") Тогда
		ПоказатьПредупреждение(Неопределено, НСтр("es='¡La reparación no es posible incluir en la composición de la operación tecnológica!';ru='Ремонт нельзя включать в состав технологической операции!';en='Repair can not be included in the technological operation!'"), 10); 
		Возврат;
	КонецЕсли;
	
	ОткрытьФорму("Справочник.торо_ТехнологическиеОперации.ФормаВыбора", Новый Структура("МножественныйВыбор", Истина), Элементы.ДеревоРемонтныхРабот);		
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборРемонтов(Команда)
	
	Если ЗначениеЗаполнено(Объект.ДокументОснование)  Тогда 
		ОткрытьФормуПодбораОРИзОснования(Элементы.ОбследованноеОборудование);
	Иначе	
		ПараметрыОткрытияФормы = Новый Структура("КлючНазначенияИспользования, ЗакрыватьПриВыборе", "торо_ВнешнееОснованиеДляРабот", Ложь);
		ОткрытьФорму("Обработка.торо_ПодборОбъектовРемонтныхРабот.Форма.ФормаПодбораОбъектовДляПланаГрафикаППР",ПараметрыОткрытияФормы,Элементы.ОбследованноеОборудование,ЭтаФорма.УникальныйИдентификатор);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборОпераций(Команда)
	
	ФормаВыбора = ПолучитьФорму("Справочник.торо_ТехнологическиеОперации.ФормаВыбора", Новый Структура("МножественныйВыбор", Истина), Элементы.ДеревоРемонтныхРабот);
	ФормаВыбора.ЗакрыватьПриВыборе = Ложь;
	ФормаВыбора.Открыть();
	
КонецПроцедуры

// Согласование++
&НаКлиенте
Процедура УтвердитьСтатус(Команда)

	торо_РаботаССогласованиямиКлиент.УстановитьСтатус(ЭтотОбъект);

КонецПроцедуры
// Согласование--
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.Свойства 
&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

&НаСервере
Процедура ОбновитьОстановочные(IDРемонта = Неопределено)
	
	Если ФОИспользоватьОстановочные Тогда
		ТекстЗапроса = "ВЫБРАТЬ
		               |	торо_ОстановочныеРемонтыСрезПоследних.IDЗависимого КАК ID,
		               |	торо_ОстановочныеРемонтыСрезПоследних.Регистратор
		               |ИЗ
		               |	РегистрСведений.торо_ОстановочныеРемонты.СрезПоследних(, IDЗависимого В (&ID)) КАК торо_ОстановочныеРемонтыСрезПоследних
		               |ГДЕ
		               |	НЕ торо_ОстановочныеРемонтыСрезПоследних.Отвязан";
		Запрос = Новый Запрос(ТекстЗапроса);
		Если IDРемонта = Неопределено Тогда
			Запрос.УстановитьПараметр("ID", Объект.ОбследованноеОборудование.Выгрузить().ВыгрузитьКолонку("ID"));
		Иначе
			Запрос.УстановитьПараметр("ID", IDРемонта);
		КонецЕсли;
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			НайденныеСтроки = Объект.ОбследованноеОборудование.НайтиСтроки(Новый Структура("ID", Выборка.ID));
			Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
				НайденнаяСтрока.ВРамкахОстановочного = Выборка.Регистратор;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ОбновитьДоступностьДляРедактирования()
	
	МассивIDДляПроверки = Объект.ОбследованноеОборудование.Выгрузить().ВыгрузитьКолонку("ID");
	МассивIDДляБлокировки = торо_Ремонты.МассивIDДляБлокировкиРемонтовОборудования(Объект.Ссылка, МассивIDДляПроверки);
	
	Если Не МассивIDДляБлокировки = Неопределено Тогда
		
		Для Каждого СтрокаРемонта Из Объект.ОбследованноеОборудование Цикл
			СтрокаРемонта.БлокироватьДляИзменения = Не МассивIDДляБлокировки.Найти(СтрокаРемонта.ID) = Неопределено;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьДляРедактированияПоТекРемонту(БлокироватьДляИзменения)
	
	Элементы.ДеревоРемонтныхРабот.ТолькоПросмотр = БлокироватьДляИзменения ИЛИ ЭтаФорма["СогласованиеТолькоПросмотр"];	
	Элементы.ДеревоРемонтныхРаботДобавитьТехОперацию.Доступность	= Не БлокироватьДляИзменения И НЕ ЭтаФорма["СогласованиеТолькоПросмотр"];
	
КонецПроцедуры


&НаКлиенте
Процедура РазвернутьДеревоРемонтныхРабот(Родитель)
	
	Элементы.ДеревоРемонтныхРабот.Развернуть(Родитель.ПолучитьИдентификатор());
	Для Каждого Строка Из Родитель.ПолучитьЭлементы() Цикл
		РазвернутьДеревоРемонтныхРабот(Строка);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДерево(ЭлементДерева, Соответствие, Родитель)
	
	МассивПодчиненныхСтрок = Соответствие.Получить(Родитель);
	
	Если Не МассивПодчиненныхСтрок = Неопределено
		И МассивПодчиненныхСтрок.Количество() > 0 Тогда
		ЭлементыДерева = ЭлементДерева.ПолучитьЭлементы();
		Если Не МассивПодчиненныхСтрок = Неопределено Тогда
			Для каждого Строка Из МассивПодчиненныхСтрок Цикл
				Элемент = ЭлементыДерева.Добавить();
				ЗаполнитьЗначенияСвойств(Элемент,Строка);
				Элемент.Картинка = 2;
				ЗаполнитьДерево(Элемент,Соответствие,Строка.ID);
			КонецЦикла; 
		КонецЕсли;
		
	КонецЕсли; 	
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьДанныеТабличныхЧастейПоIDСтрокиДерева(ТекущиеЗначения, ДокументОбъект, СтруктураТабличныхЧастей)
	
	Для Каждого КлючЗначение Из СтруктураТабличныхЧастей Цикл
		
		ПараметрыПоиска = Новый Структура;
		ПараметрыПоиска.Вставить("ID", ТекущиеЗначения.ID);
		ПараметрыПоиска.Вставить("Предписание_ID", ТекущиеЗначения.Предписание_ID);
				
		СтрокиДляУдаления = Объект.РемонтныеРаботы.НайтиСтроки(ПараметрыПоиска);
		
		Для Каждого Элемент Из СтрокиДляУдаления Цикл
			
			Объект.РемонтныеРаботы.Удалить(Элемент);
			
		КонецЦикла;
				
	КонецЦикла;
	
КонецПроцедуры

// Согласование++
&НаКлиенте
Процедура СпособСогласованияНачалоВыбораЗавершение(РезультатВопроса,ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		СогласующиеРегистр.Очистить();
		Если мХранитьИсториюСогласованияВДокументах Тогда
			Объект.Согласующие.Очистить();
		КонецЕсли;
		ОткрытьФорму("Справочник.торо_СпособыСогласованияДокументов.ФормаВыбора",,ДополнительныеПараметры.Элемент,,,,,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗавершитьУтверждениеСтатусаДокумента(ПараметрыОповещения)
	
	торо_РаботаССогласованиями.ЗавершитьУтверждениеСтатусаДокумента(ЭтаФорма, ПараметрыОповещения);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДеревоСогласующих(НовыйСпособСогласования = Ложь) 
	
	торо_РаботаССогласованиями.ОбновитьДеревоСогласующих(ЭтаФорма, НовыйСпособСогласования);
			
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеВидимостью(ДокОбъект)
	Элементы = ДокОбъект.Элементы;
	Объект = ДокОбъект.Объект;
	Элементы.ДеревоСогласованияУтвердитьСтатус.Доступность = ЗначениеЗаполнено(Объект.СпособСогласования);
КонецПроцедуры

&НаКлиенте
Процедура ИсторияСтатусовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	торо_РаботаССогласованиямиКлиент.ОткрытьЗаписьИсторииСтатусов(ЭтаФорма, Элемент.ТекущиеДанные);
	
КонецПроцедуры

// Согласование--

&НаКлиенте
Процедура ПодборОРОбработчикОжидания()
	
	Если Объект.ОбследованноеОборудование.Количество() = 0 Тогда
		ОткрытьФормуПодбораОРИзОснования(Элементы.ОбследованноеОборудование, Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуПодбораОРИзОснования(Элемент, ОткрыватьБезусловно = Истина, ОдиночныйВыбор = Ложь)
	
	стрПараметров = Новый структура("ТипВыходногоДок, ДокументыОснования, ОдиночныйВыбор, ОткрыватьБезусловно", 
			ПредопределенноеЗначение("Перечисление.торо_ВидыВыходныхДокументов.Предписание"), Объект.ДокументОснование, ОдиночныйВыбор, ОткрыватьБезусловно);
			
	ОткрытьФорму("ОбщаяФорма.торо_ФормаПодбораОРПриВводеНаОсновании", стрПараметров, Элемент,ЭтаФорма.УникальныйИдентификатор,ВариантОткрытияОкна.ОтдельноеОкно);

КонецПроцедуры

&НаКлиенте
Процедура ДеревоРемонтныхРаботКоличествоПриИзменении(Элемент)
	
	ТекСтрока = Элементы.ДеревоРемонтныхРабот.ТекущиеДанные;
	Если ТекСтрока.Количество <= 0 Тогда
		ТекСтрока.Количество = 1;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбследованноеОборудованиеОбъектРемонтаПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ОбследованноеОборудование.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ТекущиеДанные.Исполнитель = торо_ОбщегоНазначенияВызовСервера.ЗначениеРеквизитаОбъекта(ТекущиеДанные.ОбъектРемонта, "ПодразделениеИсполнитель");
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЕдиницыИзмерения(Дерево)
	Для Каждого РемРабота Из Дерево.ПолучитьЭлементы() Цикл
		Если ТипЗнч(РемРабота.РемонтнаяРабота) = Тип("СправочникСсылка.торо_ТехнологическиеОперации") Тогда
			РемРабота.ТехОперация = РемРабота.РемонтнаяРабота;
		КонецЕсли;
		ЗаполнитьЕдиницыИзмерения(РемРабота);
	КонецЦикла;  		
КонецПроцедуры

// >> [Деснол] [Ушаков А.Д.] [03.10.2019] 
&НаКлиентеНаСервереБезКонтекста
Функция дс_ПолучитьПредставлениеКорневойРемонтнойРаботы()
	Возврат НСтр("es='Los trabajos de reparación';ru='Ремонтные работы';en='Repair work'");
КонецФункции

&НаСервере
Процедура дс_ЛокализоватьУсловноеОформление()
	ИмяРеквизита = дс_ДобавитьРеквизитПредставленияКорневойРаботы();
	ЭтаФорма.дс_КорневаяРабота = дс_ПолучитьПредставлениеКорневойРемонтнойРаботы();
	дс_ЗаменитьКорневуюРаботуВУО("Ремонтные работы", ИмяРеквизита);
КонецПроцедуры

&НаСервере
Процедура дс_ЗаменитьКорневуюРаботуВУО(ИсходноеПоле, КонечноеПоле)
	Для каждого ЭлементУО Из УсловноеОформление.Элементы Цикл
		Если СтрНайти(Строка(ЭлементУО.Отбор), ИсходноеПоле) > 0 Тогда
			ТекущийОтбор = ЭлементУО.Отбор;
			ТекущийОтбор.Элементы[0].ПравоеЗначение = Новый ПолеКомпоновкиДанных(КонечноеПоле)
		КонецЕсли; 
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция дс_ДобавитьРеквизитПредставленияКорневойРаботы()
	НовыеРеквизиты = Новый Массив;
	ИмяРеквизита = "дс_КорневаяРабота";
	дс_КорневаяРабота = Новый РеквизитФормы(ИмяРеквизита, Новый ОписаниеТипов("Строка"));
	НовыеРеквизиты.Добавить(дс_КорневаяРабота);
	ИзменитьРеквизиты(НовыеРеквизиты);
	
	Возврат ИмяРеквизита;
КонецФункции 
// << [Деснол] [Ушаков А.Д.] [03.10.2019] 

фПослеОчистки = Ложь;
#КонецОбласти
